Table of Contents
 Class IdeaMaterialSteel
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaMaterialSteel : AbstractIdeaObject<IIdeaMaterialSteel>, IEquatable<AbstractIdeaObject<IIdeaMaterialSteel>>, IIdeaMaterialSteel, IIdeaMaterial, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaMaterialSteel>
IdeaMaterialSteel
Implements
IEquatable<AbstractIdeaObject<IIdeaMaterialSteel>>
IIdeaMaterialSteel
IIdeaMaterial
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaMaterialSteel>.Id
 AbstractIdeaObject<IIdeaMaterialSteel>.Name
 AbstractIdeaObject<IIdeaMaterialSteel>.Identifier
 AbstractIdeaObject<IIdeaMaterialSteel>.GetHashCode()
 AbstractIdeaObject<IIdeaMaterialSteel>.Equals(object)
 AbstractIdeaObject<IIdeaMaterialSteel>.Equals(AbstractIdeaObject<IIdeaMaterialSteel>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaMaterialSteel(Identifier<IIdeaMaterialSteel>)
public IdeaMaterialSteel(Identifier<IIdeaMaterialSteel> identifer)
Parameters
identifer Identifier<IIdeaMaterialSteel>
 IdeaMaterialSteel(int)
public IdeaMaterialSteel(int id)
Parameters
id int
 IdeaMaterialSteel(string)
public IdeaMaterialSteel(string id)
Parameters
id string
Properties
 Material
Parameters of the material.
public virtual MatSteel Material { get; set; }
Property Value
MatSteel
 Edit this page